{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP/AOoGNczZqPT1cnsgIryQ"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите функцию merge_dicts, которая принимает произвольное количество\n","словарей в качестве аргументов и возвращает новый словарь, объединяющий все\n","входные словари. Если ключи повторяются, значения должны быть объединены в\n","список. Функция должна использовать аргумент **kwargs для принятия\n","произвольного числа аргументов словаря.\n","\n","Пример ввода:\n","{'a': 1, 'b': 2}\n","{'b': 3, 'c': 4}\n","{'c': 5, 'd': 6}\n","\n","Пример вывода:\n","{'a': [1], 'b': [2, 3], 'c': [4, 5], 'd': [6]}\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def merge_dicts(**kwargs):\n","    new_dict = {}\n","    for dictionary in kwargs.values():\n","        for key, value in dictionary.items():\n","            if key in new_dict:\n","                new_dict[key].append(value)\n","            else:\n","                new_dict[key] = [value]\n","    return new_dict\n","\n","\n","dict1 = {'a': 1, 'b': 2}\n","dict2 = {'b': 3, 'c': 4}\n","dict3 = {'c': 5, 'd': 6}\n","\n","merge_dicts(d1=dict1, d2=dict2, d3=dict3)"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739205147138,"user_tz":-60,"elapsed":14,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"35958913-2d12-49b8-f773-0125a7811c31"},"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'a': [1], 'b': [2, 3], 'c': [4, 5], 'd': [6]}"]},"metadata":{},"execution_count":2}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает строку от пользователя и подсчитывает\n","количество уникальных символов в этой строке. Создайте функцию\n","count_unique_chars, которая принимает строку и возвращает количество уникальных\n","символов. Выведите результат на экран.\n","\n","Пример вывода:\n","Введите строку: hello\n","Количество уникальных символов: 4      \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["def count_unique_chars(user_list)  -> int:\n","    user_list = set(user_list)\n","    return len(user_list)\n","\n","user_list = input(\"Введите строку: \").lower()\n","print(f\"Количество уникальных символов: {count_unique_chars(user_list)}\")"],"metadata":{"id":"BvxRN8RD3WjP","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739883808635,"user_tz":-60,"elapsed":2249,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"055d0363-3469-4be2-92bc-7f818199c710"},"execution_count":10,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: hello\n","Количество уникальных символов: 4\n"]}]},{"cell_type":"markdown","source":["```\n","3. Напишите программу, которая создает словарь, содержащий информацию о\n","студентах и их оценках. Ключами словаря являются имена студентов, а значениями\n","- списки оценок. Создайте функцию calculate_average_grade, которая принимает\n","словарь с оценками студентов и вычисляет средний балл для каждого студента.\n","Функция должна возвращать новый словарь, в котором ключами являются имена\n","cтудентов, а значениями - их средний балл. Выведите результат на экран.\n","\n","\n","Пример словаря с оценками\n","\n","grades = {\n","    'Alice': [85, 90, 92],\n","    'Bob': [78, 80, 84],\n","    'Carol': [92, 88, 95]\n","}\n","\n","Пример вывода:\n","{'Alice': 89.0, 'Bob': 80.66666666666667, 'Carol': 91.66666666666667}\n","```"],"metadata":{"id":"1Hw3juqiIF7d"}},{"cell_type":"code","source":["def calculate_average_grade(grades)  -> dict:\n","    new_dict = {}\n","    for key, value in grades.items():\n","        new_dict[key] = sum(value) / len(value)\n","    return new_dict\n","\n","grades = {\n","    'Alice': [85, 90, 92],\n","    'Bob': [78, 80, 84],\n","    'Carol': [92, 88, 95]\n","}\n","print(calculate_average_grade(grades))"],"metadata":{"id":"KKzCt04pIEs9","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739884923062,"user_tz":-60,"elapsed":248,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"9ad93d22-819f-48c0-d413-39ee587b6f2b"},"execution_count":14,"outputs":[{"output_type":"stream","name":"stdout","text":["{'Alice': 89.0, 'Bob': 80.66666666666667, 'Carol': 91.66666666666667}\n"]}]}]}