{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyNaJFO7mXqle2oaiznYBeZj"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","Напишите программу, которая запрашивает у пользователя целое число и определяет, является ли оно палиндромом.\n","Число является палиндромом, если оно читается одинаково слева направо и справа налево.\n","Выведите соответствующее сообщение на экран с помощью команды print.\n","Используйте математические операции. Работу со строками использовать нельзя.\n","\n","Пример вывода:\n","Введите целое число: 12321\n","Число является палиндромом.\n","```"],"metadata":{"id":"hW4OxM-t_YpH"}},{"cell_type":"code","source":["a = int(input('Введите целое число: '))\n","if a < 0:                                      # Проверяем, является ли число отрицательным\n","    print(\"Введите положительное число.\")\n","else:\n","    temp = a\n","    revers_a = 0\n","    while temp > 0:\n","        last_number = temp % 10                # Убираем последнюю цифру\n","        revers_a = revers_a * 10 + last_number # Последняя цифра становится первой\n","        temp //= 10                            # Убираем последнюю цифру из введенного числа\n","    if a == revers_a:\n","        print('Число является палиндромом.')\n","    else:\n","        print('Число не является палиндромом.')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"BkN9BVks_V5v","executionInfo":{"status":"ok","timestamp":1730814215152,"user_tz":-60,"elapsed":2824,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"9e0e9d15-6aad-4a46-8011-a2dc011a61f6"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите целое число: 12321\n","Число является палиндромом.\n"]}]},{"cell_type":"markdown","source":["```\n","Напишите программу, которая запрашивает у пользователя целое число\n","и проверяет является ли оно числом Армстронга. Число Армстронга - это число,\n","которое равно сумме своих цифр, возведенных в степень, равную количеству цифр в числе.\n","Выведите соответствующее сообщение на экран с помощью команды print.\n","\n","Пример вывода:\n","Введите целое число: 153\n","Число является числом Армстронга.\n","```"],"metadata":{"id":"RE-VK9ijAkvC"}},{"cell_type":"code","source":["a = int(input(\"Введите целое число: \"))\n","a_str = str(a)\n","\n","num_a = 0\n","for digit in a_str:           # Считаем количество цифр в числе, можно было через len()\n","    num_a += 1\n","\n","armstrong_sum = 0\n","i = 0\n","while i < num_a:\n","    armstrong_sum += int(a_str[i]) ** num_a\n","    i += 1\n","if armstrong_sum == a:\n","    print('Число является числом Армстронга.')\n","else:\n","    print('Число не является числом Армстронга.')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"b5gZoCb-_Wpd","executionInfo":{"status":"ok","timestamp":1730815248744,"user_tz":-60,"elapsed":4417,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"009ec0cd-d570-4379-f6e8-fb4c6e0bf8f5"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите целое число: 153\n","Число является числом Армстронга.\n"]}]}]}