{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyO+ynVy8a47i7Gq35ALfQbK"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает строку от пользователя и разбивает ее\n","на отдельные слова. Затем программа должна объединить слова в обратном порядке\n","с использованием метода join(). Используйте динамический массив и методы для\n","работы со строками. Выведите результат на экран с помощью команды print.\n","\n","Пример вывода:\n","Введите предложение: Программирование это интересно и полезно\n","Перевернутое предложение: полезно и интересно это Программирование\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["text = input('Введите предложение: ')\n","split_text = text.split()\n","print(split_text)\n","revers_words = list(reversed(split_text))\n","print(revers_words)\n","return_text = ' '.join(split_text)\n","print(f'Перевернутое предложение: {return_text}')"],"metadata":{"collapsed":true,"id":"FHATZZ9fESVu","executionInfo":{"status":"ok","timestamp":1737382504266,"user_tz":-60,"elapsed":6595,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"62b91dc1-5e16-4878-aaad-3444b7cb601a"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите предложение: Программирование это интересно и полезно\n","['Программирование', 'это', 'интересно', 'и', 'полезно']\n","['полезно', 'и', 'интересно', 'это', 'Программирование']\n","Перевернутое предложение: Программирование это интересно и полезно\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает список чисел от пользователя и\n","добавляет каждое число в динамический массив. Затем программа должна принимать\n","новое число от пользователя и добавлять его в динамический массив до тех пор,\n","пока пользователь не введет команду \"Выход\". Используйте метод append() для\n","добавления элементов в динамический массив и условный оператор для проверки\n","команды \"Выход\". Выведите итоговый динамический массив на экран с помощью\n","команды print.\n","\n","Пример вывода:\n","\n","Введите число (или 'Выход' для завершения): 1\n","Введите число (или 'Выход' для завершения): 2\n","Введите число (или 'Выход' для завершения): Выход\n","Динамический массив: [1, 2]\n","```"],"metadata":{"id":"aa7lsZYAFW_W"}},{"cell_type":"code","source":["numbers = []\n","while True:\n","    number = input('Введите число (или \\'Выход\\' для завершения)): ')\n","    if number == 'Выход':\n","        break\n","    else:\n","        numbers.append(int(number))\n","print(numbers)"],"metadata":{"id":"b1sC4zD1FXvO","executionInfo":{"status":"ok","timestamp":1737382515828,"user_tz":-60,"elapsed":11569,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"c88262b9-bbda-4571-cfb2-f363efc0af39"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите число (или 'Выход' для завершения)): 1\n","Введите число (или 'Выход' для завершения)): 2\n","Введите число (или 'Выход' для завершения)): 3\n","Введите число (или 'Выход' для завершения)): 4\n","Введите число (или 'Выход' для завершения)): 5\n","Введите число (или 'Выход' для завершения)): Выход\n","[1, 2, 3, 4, 5]\n"]}]}]}