{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyNM4f/5WMHW4BOhOGgjrWdN"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая запрашивает у пользователя строку и определяет,\n","является ли она панграммой. Панграмма - это фраза, содержащая все буквы\n","алфавита. Программа должна игнорировать регистр букв и пробелы при проверке\n","панграммы. Выведите соответствующее сообщение на экран с помощью команды print.\n","Решить задачу для латиницы.\n","\n","Пример вывода:\n","Введите строку: The quick brown fox jumps over the lazy dog\n","Строка является панграммой.\n","```"],"metadata":{"id":"pQ4MPb6tg79b"}},{"cell_type":"code","source":["a = input('Введите строку: ')\n","a = a.lower().replace(' ', '')\n","vse_bykvi = 'abcdefghijklmnopqrstuvwxyz'\n","sovpadenie = []\n","for i in vse_bykvi:\n","    if i in a and i not in sovpadenie:\n","        sovpadenie.append(i)\n","if len(sovpadenie) == len(vse_bykvi):\n","    print('Строка является панграммой')\n","else:\n","    print('Строка не является панграммой')"],"metadata":{"id":"nI5-KnCYg524","executionInfo":{"status":"ok","timestamp":1732306721445,"user_tz":-60,"elapsed":5420,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"de4d3de3-99fb-40e3-f6af-c024377508bb","colab":{"base_uri":"https://localhost:8080/"}},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: The quick brown fox jumps over the lazy dog\n","Строка является панграммой\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая запрашивает у пользователя строку и\n","выводит на экран количество гласных и согласных букв в ней.\n","Используйте функцию len() для подсчета количества букв.\n","Выведите результат на экран с помощью команды print.\n","Решить задачу для латиницы.\n","\n","Пример вывода:\n","Введите строку: Hello World\n","Количество гласных букв: 3\n","Количество согласных букв: 7\n","```"],"metadata":{"id":"e9rtVhRbhD9F"}},{"cell_type":"code","source":["a = input('Введите строку: ')\n","a = a.lower().replace(' ', '')\n","glasnie = 'aeiouy'\n","soglasnie = 'bcdfghjklmnpqrstvwxz'\n","i_glasnie = []\n","i_soglasnie = []\n","for i in a:\n","    if i in glasnie:\n","        i_glasnie.append(i)\n","    elif i in soglasnie:\n","        i_soglasnie.append(i)\n","print(f'Количество согласных букв: {len(i_soglasnie)}')\n","print(f'Количество гласных букв: {len(i_glasnie)}')"],"metadata":{"id":"xi-uYypzg7S7","executionInfo":{"status":"ok","timestamp":1732306733862,"user_tz":-60,"elapsed":3318,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"2b1a246c-4130-40fc-a196-7d09a9a33c67","colab":{"base_uri":"https://localhost:8080/"}},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: Hello World\n","Количество согласных букв: 7\n","Количество гласных букв: 3\n"]}]}]}