{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP5zl+yWYryqtWxqcHqotNr"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая открывает файл, считывает из него два числа и\n","выполняет операцию их деления. Если число отрицательное, выбросите исключение\n","ValueError с сообщением \"Число должно быть положительным\". Обработайте\n","исключение и выведите соответствующее сообщение.\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["numbers = [16, 4, 8, 12, -4, 6, 18]\n","file = open(\"numbers.txt\", \"w\")\n","file.write(\", \".join(map(str, numbers)))\n","file.close()"],"metadata":{"id":"LhMVhhn4oItS","executionInfo":{"status":"ok","timestamp":1740061076421,"user_tz":-60,"elapsed":11,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":8,"outputs":[]},{"cell_type":"code","source":["def divide_numbers(num1, num2):\n","    with open(\"numbers.txt\", \"r\") as file_name:\n","        list_numbers = file_name.read().strip()\n","    print(numbers)\n","\n","    if num1 < 0 or num2 < 0:\n","        raise ValueError(\"Число должно быть положительным\")\n","    return num1 / num2\n","\n","try:\n","    print(divide_numbers(numbers[0], numbers[2]))\n","except ValueError as ve:\n","    print(\"Ошибка:\", ve)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PEvXae-O5knc","executionInfo":{"status":"ok","timestamp":1740061087064,"user_tz":-60,"elapsed":9,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"61b9da54-50f7-4fab-9b3d-da10945202b4"},"execution_count":10,"outputs":[{"output_type":"stream","name":"stdout","text":["[16, 4, 8, 12, -4, 6, 18]\n","2.0\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая открывает файл, считывает его содержимое и\n","выполняет операции над числами в файле. Обработайте возможные исключения при\n","открытии файла (FileNotFoundError) и при выполнении операций над числами\n","(ValueError, ZeroDivisionError). Используйте конструкцию try-except-finally для\n","обработки исключений и закрытия файла в блоке finally.    \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["def new_feature(file_name):\n","    f = None\n","    try:\n","        f = open(file_name, \"r\")\n","        list_number = f.read()\n","        print(list_number)\n","        numbers = [int(num) for num in list_number.split(\", \")]\n","        num1 = numbers[0]\n","        num2 = numbers[1]\n","        print(f'Деление: {num1 / num2}, умножение: {num1 * num2}, сумма: {num1 + num2}')\n","    except FileNotFoundError:\n","        print(\"Файл не найден.\")\n","    except ZeroDivisionError:\n","        print(\"На ноль делить нельзя.\")\n","    except ValueError:\n","        print(\"Что-то с данными в файле\")\n","    finally:\n","        if f is not None:\n","            f.close()\n","\n","file_name = input(\"Введите имя файла: \")\n","new_feature(file_name)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hI9rvghtIDQv","executionInfo":{"status":"ok","timestamp":1740062213983,"user_tz":-60,"elapsed":7070,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"a292c7ee-88b8-4c85-a5d0-555c0497a06f"},"execution_count":24,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите имя файла: numbers.txt\n","16, 4, 8, 12, -4, 6, 18\n","Деление: 4.0, умножение: 64, сумма: 20\n"]}]}]}