{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyPqqnpW1YPV7B3EC5Dyb54q"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите функцию, которая принимает список кортежей\n","от пользователя, где каждый кортеж содержит информацию\n","о студенте (имя, возраст, средний балл). Программа\n","должна вывести на экран имена студентов, чей средний\n","балл выше заданного значения. Используйте методы\n","кортежей и циклы для обработки данных. Выведите\n","итоговый список на экран с помощью команды print.\n","\n","Пример списка кортежей:\n","[(\"Alice\", 20, 90), (\"Bob\", 19, 80), (\"Charlie\", 21, 95), (\"David\", 18, 85)]\n","\n","Пример вывода:\n","Введите пороговое значение среднего балла: 90\n","Студенты с средним баллом выше 90 : ['Charlie']\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def student_high_score():\n","    number_of_student = int(input('Количество студентов для анализа: '))\n","    list_student = []\n","\n","    for i in range(number_of_student):\n","        student_name = input('Введите имя студента: ')\n","        student_age = int(input('Введите возраст возраст: '))\n","        student_score = int(input('Введите средний балл студента: '))\n","        student_inf = (student_name, student_age, student_score)\n","        list_student.append(student_inf)\n","    print(list_student)\n","\n","    value = int(input('Введите пороговое значение среднего балла: '))\n","    names_students = []\n","\n","    for student in list_student:\n","        if student[2] > value:\n","            names_students.append(student[0])\n","    print(f'Студенты с средним баллом выше 90 : {names_students}')"],"metadata":{"id":"zeHvl47uHxw2","executionInfo":{"status":"ok","timestamp":1737650707977,"user_tz":-60,"elapsed":263,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":34,"outputs":[]},{"cell_type":"code","source":["student_high_score()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"JEdniNf7PpEl","executionInfo":{"status":"ok","timestamp":1737650756613,"user_tz":-60,"elapsed":45167,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"c2042c47-63a7-4d84-b300-ec1c5fa66270"},"execution_count":35,"outputs":[{"output_type":"stream","name":"stdout","text":["Количество студентов для анализа: 4\n","Введите имя студента: Alice\n","Введите возраст возраст: 20\n","Введите средний балл студента: 90\n","Введите имя студента: Bob\n","Введите возраст возраст: 19\n","Введите средний балл студента: 80\n","Введите имя студента: Charlie\n","Введите возраст возраст: 21\n","Введите средний балл студента: 95\n","Введите имя студента: David\n","Введите возраст возраст: 18\n","Введите средний балл студента: 85\n","[('Alice', 20, 90), ('Bob', 19, 80), ('Charlie', 21, 95), ('David', 18, 85)]\n","Введите пороговое значение среднего балла: 90\n","Студенты с средним баллом выше 90 : ['Charlie']\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает строку от\n","пользователя и разбивает ее на отдельные слова. Затем\n","программа должна создать новый кортеж, содержащий\n","длину каждого слова в исходной строке. Используйте\n","методы строк и кортежей для обработки данных.\n","\n","Пример вывода:\n","\n","Введите предложение: Программирование это интересно и полезно\n","Длины слов в предложении: (15, 3, 8, 2, 6)\n","```"],"metadata":{"id":"aa7lsZYAFW_W"}},{"cell_type":"code","source":["sentence = input('Введите предложение: ')\n","sentence_split = sentence.split()\n","\n","len_words = []\n","for word in sentence_split:\n","    len_words.append(len(word))\n","\n","result = tuple(len_words)\n","print(f'Длины слов в предложении: {result}')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"wvzFN1pP5ESo","executionInfo":{"status":"ok","timestamp":1737650791482,"user_tz":-60,"elapsed":6956,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"8c308c8f-41b3-486a-c965-b9ee0be607f3"},"execution_count":36,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите предложение: Программирование это интересно и полезно\n","Длины слов в предложении: (16, 3, 9, 1, 7)\n"]}]}]}