{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyPTatJUva/0rvw1rf0xL1Sg"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Написать программу, вычисляющую факториал числа.\n","Решить задачу с помощью рекурсии.\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def factorial(n) -> int:\n","    if n <= 1:\n","        return 1\n","    return factorial(n - 1) * n\n","\n","\n","number = int(input('Введите число: '))\n","print(f'Факториал числа {number} равен {factorial(number)}')"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1738686751842,"user_tz":-60,"elapsed":3359,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"f7468eb6-f1d4-4dbd-e33d-000c92200006"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите число: 3\n","Факториал числа 3 равен 6\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая использует рекурсию для вычисления суммы цифр\n","числа. Создайте функцию sum_digits, которая принимает один аргумент - число,\n","для которого нужно вычислить сумму цифр. Используйте условие выхода из\n","рекурсии, когда число состоит из одной цифры. Выведите результат на экран.\n","\n","Пример вывода:\n","Введите число: 12345\n","Сумма цифр числа 12345 равна 15\n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["def sum_digits(number) -> int:\n","    if number < 10:\n","        return number\n","    return number % 10 + sum_digits(number // 10)\n","\n","\n","number = int(input('Введите число: '))\n","print(f'Сумма цифр числа {number} равна {sum_digits(number)}')"],"metadata":{"id":"BvxRN8RD3WjP","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1738686777119,"user_tz":-60,"elapsed":4221,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"2105d243-3e52-4660-9e51-f9831b234636"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите число: 12345\n","Сумма цифр числа 12345 равна 15\n"]}]}]}