{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyNWGzeM9drt81S7i1SP8q5E"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает два числа и возвращает их сумму и\n","произведение в виде кортежа (sum, product). Используйте функцию для вычисления\n","суммы и произведения. Выведите результат на экран с помощью команды print.\n","\n","Пример вывода:\n","\n","Введите первое число: 3\n","Введите второе число: 4\n","Сумма и произведение чисел: (7, 12)\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def sum_product():\n","    first_number = int(input('Введите первое число: '))\n","    second_number = int(input('Введите второе число: '))\n","    sum = first_number + second_number\n","    product = first_number * second_number\n","    print(f'Сумма и произведение чисел: ({sum}, {product})')"],"metadata":{"collapsed":true,"id":"FHATZZ9fESVu","executionInfo":{"status":"ok","timestamp":1737379072074,"user_tz":-60,"elapsed":385,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":21,"outputs":[]},{"cell_type":"code","source":["sum_product()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"taz7x-5xRsgT","executionInfo":{"status":"ok","timestamp":1737379080627,"user_tz":-60,"elapsed":4058,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"c6853a05-5a26-496e-b5d1-d9e386696477"},"execution_count":22,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите первое число: 3\n","Введите второе число: 4\n","Сумма и произведение чисел: (7, 12)\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает список чисел и возвращает сумму,\n","минимальное и максимальное значение из списка. Используйте функцию для\n","обработки списка чисел и возврата трех значений. Выведите результат на экран с\n","помощью команды print.\n","\n","Пример вывода:\n","\n","Введите числа:  3, 7, 2, 9, 1, 5\n","Сумма чисел: 27\n","Минимальное значение: 1\n","Максимальное значение: 9\n","```"],"metadata":{"id":"aa7lsZYAFW_W"}},{"cell_type":"code","source":["def sum_max_min():\n","    numbers = input('Введите числа: ')\n","    number_list = list(map(int, numbers.split(',')))\n","    sum = 0\n","    for i in number_list:\n","        sum += i\n","    print(f'Сумма чисел: {sum}\\nМинимальное значение: {min(number_list)}\\nМаксимальное значение: {max(number_list)}')"],"metadata":{"id":"b1sC4zD1FXvO"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["sum_max_min()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"s7cTRkHof-h4","executionInfo":{"status":"ok","timestamp":1737376338859,"user_tz":-60,"elapsed":3921,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"8e46d11f-e0aa-4589-fb83-c4f8d080778f"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите числа: 3, 7, 2, 9, 1, 5\n","Сумма чисел: 27\n","Минимальное значение: 1\n","Максимальное значение: 9\n"]}]},{"cell_type":"code","source":["def sum_max_min_1():\n","    numbers = input('Введите числа: ')\n","    number_list = list(map(int, numbers.split(',')))\n","    total_sum = sum(number_list)\n","    minimum = min(number_list)\n","    maximum = max(number_list)\n","    print(f'Сумма чисел: {total_sum}\\nМинимальное значение: {minimum}\\nМаксимальное значение: {maximum}')"],"metadata":{"id":"3vAHfcaLnbAL"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["sum_max_min_1()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"q-FRD8cbnp1A","executionInfo":{"status":"ok","timestamp":1737376345479,"user_tz":-60,"elapsed":2597,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"719b531b-5873-4e82-a161-d1df5bebf732"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите числа: 3, 7, 2, 9, 1, 5\n","Сумма чисел: 27\n","Минимальное значение: 1\n","Максимальное значение: 9\n"]}]}]}