{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyNovaCZemP6DkWcSAcABY2y"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает матрицу (вложенный список) от\n","пользователя и находит сумму всех элементов в матрице. Используйте вложенные\n","списки и циклы для обхода элементов матрицы.\n","\n","Пример матрицы: [[1, 2, 3], [4, 5, 6], [7, 8, 9]]\n","\n","Пример вывода:\n","Сумма элементов в матрице: 45\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def sum_numbers_matrix():\n","    matrix = []\n","\n","    while True:\n","        row_input = input(\"Введите числа, через запятую (или 'End' для завершения ввода): \")\n","        if row_input == 'End':\n","            break\n","        else:\n","            row = list(map(int, row_input.split(',')))\n","            matrix.append(row)\n","\n","    total_sum = 0\n","    for row in matrix:\n","        for number in row:\n","            total_sum += number\n","    print(f'Сумма элементов в матрице: {total_sum}')"],"metadata":{"id":"Dp3PVFzgk22A","executionInfo":{"status":"ok","timestamp":1737732123112,"user_tz":-60,"elapsed":238,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":3,"outputs":[]},{"cell_type":"code","source":["sum_numbers_matrix()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"LhMVhhn4oItS","executionInfo":{"status":"ok","timestamp":1737732148846,"user_tz":-60,"elapsed":23795,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"a7b599c9-abc7-4954-9676-038c09d7ebcd"},"execution_count":4,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите числа, через запятую (или 'End' для завершения ввода): 1, 2, 3\n","Введите числа, через запятую (или 'End' для завершения ввода): 4, 5, 6\n","Введите числа, через запятую (или 'End' для завершения ввода): 7, 8, 9\n","Введите числа, через запятую (или 'End' для завершения ввода): End\n","Сумма элементов в матрице: 45\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает список чисел от пользователя и\n","сортирует его в порядке убывания, используя метод sort() и параметр\n","reverse=True. Выведите отсортированный список на экран.\n","\n","Пример вывода:\n","\n","Введите список чисел, разделенных пробелами: 5 2 8 1 3\n","Отсортированный список чисел: [8, 5, 3, 2, 1]\n","```"],"metadata":{"id":"aa7lsZYAFW_W"}},{"cell_type":"code","source":["def list_numbers():\n","    list_number = list(map(int, input('Введите список чисел, разделенных пробелами: ').split()))\n","    print(list_number)\n","    list_number.sort(reverse=True)\n","    print(f'Отсортированный список чисел: {list_number}')"],"metadata":{"id":"b1sC4zD1FXvO","executionInfo":{"status":"ok","timestamp":1737732201997,"user_tz":-60,"elapsed":238,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":5,"outputs":[]},{"cell_type":"code","source":["list_numbers()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"BvxRN8RD3WjP","executionInfo":{"status":"ok","timestamp":1737732208301,"user_tz":-60,"elapsed":5009,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"a301cfba-637f-45f2-951f-f23688be1d66"},"execution_count":6,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите список чисел, разделенных пробелами: 5 2 8 1 3\n","[5, 2, 8, 1, 3]\n","Отсортированный список чисел: [8, 5, 3, 2, 1]\n"]}]}]}