{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "f16244a6-2c8f-40d6-9ddb-9c4d176a3eb1",
   "metadata": {},
   "source": [
    "```\n",
    "1. Напишите программу, которая генерирует случайное число от 1 до 100, а затем предлагает пользователю угадать это число. Если пользователь угадывает число, программа выводит сообщение о победе. Если пользователь не угадывает число, программа сообщает, больше или меньше загаданное число и предлагает попробовать снова. Используйте цикл с инструкцией break, чтобы остановить выполнение цикла, когда число угадано.\n",
    "\n",
    "Пример вывода:\n",
    "Угадайте число от 1 до 100: 50\n",
    "Загаданное число меньше.\n",
    "Попробуйте снова: 75\n",
    "Загаданное число больше.\n",
    "Попробуйте снова: 63\n",
    "Поздравляю! Вы угадали число 63!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f1755e87-3b6f-4ef9-b49f-ad75fc29aad1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Угадайте число от 1 до 100:  44\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Загаданное число меньше. Попробуйте снова: 12\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Угадайте число от 1 до 100:  13\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Загаданное число меньше. Попробуйте снова: 12\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Угадайте число от 1 до 100:  12\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поздравляю! Вы угадали число 12!\n"
     ]
    }
   ],
   "source": [
    "import random\n",
    "a = random.randint(1, 100)\n",
    "while True:\n",
    "    b = int(input('Угадайте число от 1 до 100: '))\n",
    "    if a == b:\n",
    "        print(f'Поздравляю! Вы угадали число {b}!')\n",
    "        break\n",
    "    elif b < a:\n",
    "        print(f'Загаданное число больше. Попробуйте снова: {a}')\n",
    "    else:\n",
    "        print(f'Загаданное число меньше. Попробуйте снова: {a}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "97b48c32-fb14-4f26-8408-3714a448090b",
   "metadata": {},
   "source": [
    "```\n",
    "2. Напишите программу, которая запрашивает у пользователя число N и выводит первые N чисел Фибоначчи. Числа Фибоначчи - это последовательность чисел, где каждое следующее число является суммой двух предыдущих чисел (начиная с 0 и 1). Используйте цикл while для решения задачи. Выведите числа через запятую с помощью команды print.\n",
    "\n",
    "Пример вывода:\n",
    "Введите число N: 7\n",
    "Первые 7 чисел Фибоначчи: 0, 1, 1, 2, 3, 5, 8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "436f38af-320c-4a2c-9fbd-7796cdfda728",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите число N:  7\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Первые 7 чисел Фибоначчи: [0, 1, 1, 2, 3, 5, 8]\n"
     ]
    }
   ],
   "source": [
    "N = int(input('Введите число N: '))\n",
    "a = 0\n",
    "b = 1\n",
    "fib_list = []\n",
    "count = 0\n",
    "while count < N:\n",
    "    fib_list.append(a)             # .append() - добавляем к списку в конец еще одну запись\n",
    "    a, b = b, a + b\n",
    "    count += 1\n",
    "print(f'Первые {N} чисел Фибоначчи: {fib_list}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "043672d4-aa5e-4a98-bdaf-ce3c1c180c7a",
   "metadata": {},
   "source": [
    "```\n",
    "3. Напишите программу, которая запрашивает у пользователя целое положительное число и проверяет, является ли оно простым. Простое число - это число, которое делится только на 1 и на само себя без остатка. Используйте цикл while и проверку деления числа на все числа от 2 до N-1 для решения задачи. Выведите соответствующее сообщение на экран с помощью команды print.\n",
    "\n",
    "Пример вывода:\n",
    "Введите целое положительное число: 17\n",
    "Число 17 является простым."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "2606b4bd-011f-43e0-9874-532da3d76013",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите целое положительное число:  17\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число 17 является простым\n"
     ]
    }
   ],
   "source": [
    "# 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101...\n",
    "N = int(input('Введите целое положительное число: ')) \n",
    "if N <= 1:\n",
    "    print('Число должно быть больше 1')\n",
    "else:\n",
    "    n = 2\n",
    "    while n < N:\n",
    "        if N % n == 0:    # проверяем условие что n не должно делиться на N-1\n",
    "            print(f'Число {N} не является простым')\n",
    "            break\n",
    "        n += 1\n",
    "    else:\n",
    "        print(f'Число {N} является простым')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c4293797-ad00-45e8-8207-da9b716d7369",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bf975c5e-fd5f-4869-9020-55ec4dac771c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
