{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP5ShbD1V7tqB/tuVQklysy"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает список слов и возвращает список, содержащий только анаграммы.\n","\n","Анаграммы - это слова, составленные из одних и тех же букв, но в разном порядке.\n","\n","Создайте функцию anagrams, которая принимает список слов в качестве аргумента и\n","возвращает список анаграмм. Используйте множества и сортировку букв в слове для\n","проверки на анаграмму. Выведите результат на экран.\n","\n","Пример переданного списка слов:\n","['cat', 'dog', 'tac', 'god', 'act']\n","Пример вывода:\n","Анаграммы: ['dog', 'god'], ['cat', 'tac', 'act']\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def anagrams(list_word):\n","    anagram = {}\n","    result = []\n","\n","    for word in list_word:\n","        sort_word = ''.join(sorted(word))\n","\n","        if sort_word in anagram:\n","            anagram[sort_word].append(word)\n","        else:\n","            anagram[sort_word] = [word]\n","    for group in anagram.values():\n","        if len(group) > 1:\n","            result.append(group)\n","    return result\n","\n","\n","list_word = ['cat', 'dog', 'tac', 'god', 'act']\n","result = anagrams(list_word)\n","print(f'Анаграммы: {result}')"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1738600647768,"user_tz":-60,"elapsed":319,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"fd30e1ed-f4c3-4ebe-f55b-d583810761e1"},"execution_count":15,"outputs":[{"output_type":"stream","name":"stdout","text":["Анаграммы: [['cat', 'tac', 'act'], ['dog', 'god']]\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите функцию is_subset, которая принимает два множества set1 и set2 и\n","проверяет, является ли set1 подмножеством set2. Функция должна возвращать True,\n","если все элементы из set1 содержатся в set2, и False в противном случае.\n","Функция должна быть реализована без использования встроенных методов issubset\n","или <=.\n","\n","Пример множеств\n","{1, 2, 3}\n","{1, 2, 3, 4, 5}\n","\n","Пример вывода:\n","True       \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["def is_subset(set1, set2):\n","    for element in set1:\n","        if element not in set2:\n","            return False\n","    return True\n","\n","set1 = {1, 2, 3}\n","set2 = {1, 2, 3, 4, 5}\n","print(is_subset(set1, set2))"],"metadata":{"id":"BvxRN8RD3WjP","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1738600127812,"user_tz":-60,"elapsed":309,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"adb8f811-48fc-4f6b-ea54-1ab422bd781f"},"execution_count":7,"outputs":[{"output_type":"stream","name":"stdout","text":["True\n"]}]}]}