{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyM6IFMvOhtRD3G2y7oH4t81"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая генерирует и выводит квадраты чисел от 1 до N с\n","использованием генераторного выражения. Реализуйте функцию generate_squares,\n","которая принимает число N в качестве аргумента и использует генераторное\n","выражение для генерации квадратов чисел. Затем выведите квадраты чисел на экран.\n","\n","Пример работы программы:\n","1\n","4\n","9\n","16\n","25\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["from typing import Iterator\n","\n","n = int(input(\"Введите число n: \"))\n","\n","\n","def generate_squares(n: int) -> Iterator[int]:\n","    for i in range(1, n + 1):\n","        yield i ** 2\n","\n","\n","for square in generate_squares(n):\n","    print(square)"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1741898900274,"user_tz":-60,"elapsed":2684,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"e58b79a5-ebaf-43d1-beb3-9fdeeb9384d4"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите число n: 5\n","1\n","4\n","9\n","16\n","25\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите генератор, который будет генерировать бесконечную\n","последовательность Фибоначчи. Каждый раз, когда генератор вызывается, он должен\n","возвращать следующее число последовательности. Напишите программу, которая\n","будет использовать этот генератор для вывода первых N чисел Фибоначчи.\n","\n","Пример вывода:\n","Введите количество чисел Фибоначчи: 10\n","Первые 10 чисел Фибоначчи:\n","\n","0\n","1\n","1\n","2\n","3\n","5\n","8\n","13\n","21\n","34   \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["numbers = int(input(\"Введите количество чисел Фибоначчи: \"))\n","\n","\n","def generator_fib():\n","    a, b = 0, 1\n","    while True:\n","        yield a\n","        a, b = b, a + b\n","\n","\n","print(f'Первые {numbers} чисел Фибоначчи:')\n","\n","fib_gen = generator_fib()\n","\n","for _ in range(numbers):\n","    print(next(fib_gen))"],"metadata":{"id":"hI9rvghtIDQv","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1741899084978,"user_tz":-60,"elapsed":2734,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"0e1c717e-0bf4-4f1b-9a82-decda8c06198"},"execution_count":6,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите количество чисел Фибоначчи: 5\n","Первые 5 чисел Фибоначчи:\n","0\n","1\n","1\n","2\n","3\n"]}]}]}