{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP94Doksw2s+ERxwaOpsdkx"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая генерирует и выводит квадраты чисел от 1 до N с\n","использованием генераторного выражения. Реализуйте функцию generate_squares,\n","которая принимает число N в качестве аргумента и использует генераторное\n","выражение для генерации квадратов чисел. Затем выведите квадраты чисел на экран.\n","\n","Пример работы программы:\n","1\n","4\n","9\n","16\n","25\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["N = int(input(\"Введите число N: \"))\n","\n","\n","def generate_squares(N: int) -> int:\n","    for n in range(1, N + 1):\n","        yield n ** 2\n","\n","for square in generate_squares(N):\n","    print(square)"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1740406696865,"user_tz":-60,"elapsed":3155,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"1287aab2-a0b3-46fa-fa68-61cf09f49828"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите число N: 5\n","1\n","4\n","9\n","16\n","25\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите генератор, который будет генерировать бесконечную\n","последовательность Фибоначчи. Каждый раз, когда генератор вызывается, он должен\n","возвращать следующее число последовательности. Напишите программу, которая\n","будет использовать этот генератор для вывода первых N чисел Фибоначчи.\n","\n","Пример вывода:\n","Введите количество чисел Фибоначчи: 10\n","Первые 10 чисел Фибоначчи:\n","\n","0\n","1\n","1\n","2\n","3\n","5\n","8\n","13\n","21\n","34   \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["N = int(input(\"Введите количество чисел Фибоначчи: \"))\n","\n","\n","def generator_fib():\n","    a, b = 0, 1\n","    while True:\n","        yield a\n","        a, b = b, a + b\n","\n","print(f'Первые {N} чисел Фибоначчи:')\n","fib_gen = generator_fib()\n","\n","for _ in range(N):\n","    print(next(fib_gen))"],"metadata":{"id":"hI9rvghtIDQv","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1740402582187,"user_tz":-60,"elapsed":1979,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"2d01bd79-2b1d-40d3-ad4d-1a638f1efc17"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите количество чисел Фибоначчи: 10\n","Первые 10 чисел Фибоначчи:\n","0\n","1\n","1\n","2\n","3\n","5\n","8\n","13\n","21\n","34\n"]}]}]}