{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyNFmc1yiwooPcibIvu27rC8"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая подсчитывает количество вхождений каждого слова\n","в тексте и выводит на экран наиболее часто встречающиеся слова. Для решения\n","задачи используйте класс Counter из модуля collections. Создайте функцию\n","count_words, которая принимает текст в качестве аргумента и возвращает словарь\n","с количеством вхождений каждого слова. Выведите наиболее часто встречающиеся\n","слова и их количество.\n","\n","Пример вывода:\n","Введенный текст: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed sed lacinia est.\n","\n","sed: 2\n","Lorem: 1\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["from collections import Counter\n","\n","\n","def count_words(user_list):\n","    user_list = list(map(lambda word: word.replace(',', '').replace('.', ''), user_list))\n","    counter = Counter(user_list)\n","    most_common_word, count = counter.most_common(1)[0]\n","    return most_common_word, count\n","\n","user_list = input(\"Введенный текст: \").lower().split()\n","most_common_word, count = count_words(user_list)\n","\n","print(f\"Самое часто встречающееся слово: '{most_common_word}', встречается {count} раз\")"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739889123884,"user_tz":-60,"elapsed":4647,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"128742d0-6697-47f2-a518-312a568b4b8f"},"execution_count":19,"outputs":[{"output_type":"stream","name":"stdout","text":["Введенный текст: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed sed lacinia est.\n","Самое часто встречающееся слово: 'sed', встречается 2 раз\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая создает именованный кортеж Person для хранения\n","информации о человеке, включающий поля name, age и city. Создайте список\n","объектов Person и выведите информацию о каждом человеке на экран.\n","\n","Пример вывода:\n","\n","Name: Alice, Age: 25, City: New York\n","Name: Bob, Age: 30, City: London\n","Name: Carol, Age: 35, City: Paris     \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["from collections import namedtuple\n","\n","Person = namedtuple('Person', ['Name', 'Age', 'City'])\n","\n","info_people = [\n","    Person(Name = 'Alice', Age = 25, City = 'New York'),\n","    Person(Name = 'Bob', Age = 30, City = 'London'),\n","    Person(Name = 'Carol', Age = 35, City = 'Paris')\n","]\n","\n","for person in info_people:\n","    print(f\"Name: {person.Name}, Age: {person.Age}, City: {person.City}\")"],"metadata":{"id":"BvxRN8RD3WjP","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739890707918,"user_tz":-60,"elapsed":364,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"1a970e78-8031-4626-d44d-86076f8f270d"},"execution_count":29,"outputs":[{"output_type":"stream","name":"stdout","text":["Name: Alice, Age: 25, City: New York\n","Name: Bob, Age: 30, City: London\n","Name: Carol, Age: 35, City: Paris\n"]}]},{"cell_type":"markdown","source":["```\n","3. Напишите программу, которая принимает словарь от пользователя и ключ, и\n","возвращает значение для указанного ключа с использованием метода get или\n","setdefault. Создайте функцию get_value_from_dict, которая принимает словарь и\n","ключ в качестве аргументов, и возвращает значение для указанного ключа,\n","используя метод get или setdefault в зависимости от выбранного варианта.\n","Выведите полученное значение на экран.\n","\n","Пример словаря:\n","my_dict = {'apple': 5, 'banana': 6, 'cherry': 7}\n","\n","Пример вывода:\n","\n","Введите ключ для поиска: banana\n","Использовать метод get (y/n)? y\n","Значение для ключа 'banana': 6\n","\n","\n","```"],"metadata":{"id":"1Hw3juqiIF7d"}},{"cell_type":"code","source":["def get_value_from_dict(my_dict):\n","    search_key = input('Введите ключ для поиска: ').lower()\n","    select_method = input('Использовать метод get (y/n)? ').lower()\n","\n","    if select_method == 'y':\n","        value = my_dict.get(search_key, \"Ключ не найден\")\n","        print(f'Значение для ключа \"{search_key}\": {value}')\n","    elif select_method == 'n':\n","        value = my_dict.setdefault(search_key, 'Ключ не найден')\n","        print(f'Значение для ключа \"{search_key}\": {value}')\n","    else:\n","        raise ValueError('Неправильный выбор')\n","\n","my_dict = {'apple': 5, 'banana': 6, 'cherry': 7}\n","get_value_from_dict(my_dict)"],"metadata":{"id":"KKzCt04pIEs9","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739892590891,"user_tz":-60,"elapsed":7960,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"ef0d4467-5221-4ff6-f2e6-42e95a7a8cbc"},"execution_count":54,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите ключ для поиска: BananA\n","Использовать метод get (y/n)? n\n","Значение для ключа \"banana\": 6\n"]}]}]}