{
 "cells": [
  {
   "cell_type": "raw",
   "id": "6faeb803-6cd1-4aef-942f-1dedde2ba06c",
   "metadata": {},
   "source": [
    "1. Давайте создадим простой калькулятор. Напишите программу, которая запрашивает у пользователя два целых числа и выполняет следующие действия:\n",
    "- Вычисляет сумму и выводит результат.\n",
    "- Вычисляет разность и выводит результат (первое число минус второе число).\n",
    "- Вычисляет произведение и выводит результат.\n",
    "- Вычисляет частное (результат деления первого числа на второе) и выводит результат.\n",
    "- Вычисляет остаток от деления первого числа на второе и выводит результат.\n",
    "- Возводит первое число в степень второго числа и выводит результат."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "30055a8c-3455-4150-a92e-7788eb32d12b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите первое число: 8\n",
      "Введите второе число: 2\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "6\n",
      "16\n",
      "4.0\n",
      "0\n",
      "4\n",
      "64\n"
     ]
    }
   ],
   "source": [
    "# Первый вариант калькулятора\n",
    "a, b = int(input('Введите первое число:')), int(input('Введите второе число:'))\n",
    "print(a + b)\n",
    "print(a - b)\n",
    "print(a * b)\n",
    "try:                                         # try - что делаем \n",
    "    print(a / b)\n",
    "except ZeroDivisionError:                    # except - исключение, ZeroDivisionError - тип ошибки для исключения\n",
    "    print(\"Ошибка: Нельзя делить на ноль.\")\n",
    "try:\n",
    "    print(a % b)                             # взятие остатка от деления\n",
    "except ZeroDivisionError: \n",
    "    print(\"Ошибка: Нельзя делить на ноль.\")\n",
    "try:\n",
    "    print(a // b)                            # целочисленное деление\n",
    "except ZeroDivisionError: \n",
    "    print(\"Ошибка: Нельзя делить на ноль.\")\n",
    "print(a ** b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "198a335b-3d26-4fbc-928c-ce7907028830",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(64,)"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Второй вариант калькулятора\n",
    "def calculator(a, b, operation):\n",
    "    if operation == '+':                     # if - если, elif - или если, else - то\n",
    "        return a + b\n",
    "    elif operation == '-':\n",
    "        return a - b\n",
    "    elif operation == '*':\n",
    "        return a * b\n",
    "    elif operation == '/' and b !=0:\n",
    "        return a / b,\n",
    "    elif operation == '*':\n",
    "        return a % b\n",
    "    elif operation == '/' and b !=0:\n",
    "        return a // b,   \n",
    "    elif operation == '**':\n",
    "        return a ** b,\n",
    "    else: \n",
    "        return 'Wrong operation'\n",
    "calculator(8,2, '**')"
   ]
  },
  {
   "cell_type": "raw",
   "id": "c27b6fb9-46ae-46e5-9a0a-4c761b9854bc",
   "metadata": {},
   "source": [
    "2. Есть круглая арена цирка, нам известен ее радиус, нужно подобрать покрытие для этой арены, чтобы это сделать необходимо узнать длину и площадь окружности. Напишите программу, которая запрашивает у пользователя радиус окружности и выполняет следующие действия:\n",
    "- Вычисляет длину окружности по формуле 2 * pi * r, где pi – математическая константа (примерно равна 3.14159), а r – радиус окружности. Выводит результат.\n",
    "- Вычисляет площадь окружности по формуле pi * r^2, где pi – математическая константа, а r – радиус окружности. Выводит результат.\n",
    "\n",
    "Пример вывода:\n",
    "Введите радиус окружности: 4.5\n",
    "Длина окружности: 28.274333882308138\n",
    "Площадь окружности: 63.61725123519331"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b3eb5a99-6b0c-49d1-8bbe-a0eee50c46ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите радиус окружности:  4.5\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Длина окружности: 28.27431\n",
      "Площадь окружности: 63.617197499999996\n"
     ]
    }
   ],
   "source": [
    "r = float(input('Введите радиус окружности: '))\n",
    "pi = 3.14159\n",
    "print(f'Длина окружности: {2 * pi * r}')\n",
    "print(f'Площадь окружности: {pi * r ** 2}')"
   ]
  },
  {
   "cell_type": "raw",
   "id": "a2c81e5e-90dd-46a9-a1c1-a1ff620b82d4",
   "metadata": {},
   "source": [
    "3. Географ хочет находить расстояние между двумя точками на карте. Напишите для него программу, которая запрашивает у пользователя координаты двух точек в двумерном пространстве (x1, y1) и (x2, y2), а затем вычисляет и выводит расстояние между этими точками по формуле:\n",
    "\n",
    "distance = sqrt((x2 - x1)^2 + (y2 - y1)^2)\n",
    "\n",
    "где sqrt - функция извлечения квадратного корня. Не используйте встроенную математическую функцию sqrt для вычисления корня. Не забывайте, что sqrt(x)==x**0.5. Результат должен быть выведен с помощью команды print.\n",
    "\n",
    "Пример вывода:\n",
    "Введите координаты первой точки (x1, y1): 2, 3\n",
    "Введите координаты второй точки (x2, y2): 5, 7\n",
    "Расстояние между точками: 5.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "988eca99-f675-4a5f-9ce6-b03662ce5942",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите координаты первой точки (x1, y1):  2, 3\n",
      "Введите координаты первой точки (x2, y2):  5, 7\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Расстояние между точками: 5.0\n"
     ]
    }
   ],
   "source": [
    "# map - используется для применения функции к каждому элементу итерируемого объекта\n",
    "# .slpit() - преобразует строку в list по разделителю - по умолчанию это пробел\n",
    "x1, y1 = map(int, input('Введите координаты первой точки (x1, y1): ').split(',')) \n",
    "x2, y2 = map(int, input('Введите координаты второй точки (x2, y2): ').split(',')) \n",
    "distance = (((x2 - x1)**2 + (y2 - y1)**2)) ** 0.5\n",
    "print(f'Расстояние между точками: {distance}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0c84bb06-e00c-41bd-bfaa-10f9b8de512d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
