{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOpRj7v3IhD7JiuN8yuElOG"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает список чисел от пользователя и\n","передает его в функцию modify_list, которая изменяет элементы списка. Функция\n","должна умножить нечетные числа на 2, а четные числа разделить на 2. Выведите\n","измененный список на экран. Объясните, почему изменения происходят только\n","внутри функции и как работают изменяемые и неизменяемые параметры.\n","\n","Пример вывода:\n","Введите список чисел, разделенных пробелами: 1 2 3 4 5\n","Измененный список чисел: [2, 1, 6, 2, 10]\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["def modify_list(user_list):\n","    new_list = []\n","    for number in user_list:\n","        if number % 2 == 0:\n","            new_list.append(number // 2)\n","        else:\n","            new_list.append(number * 2)\n","    return new_list"],"metadata":{"id":"LhMVhhn4oItS","executionInfo":{"status":"ok","timestamp":1738002961109,"user_tz":-60,"elapsed":862,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}}},"execution_count":1,"outputs":[]},{"cell_type":"code","source":["user_list = list(map(int, input('Введите список чисел, разделенных пробелами: ').split()))\n","print(f'Измененный список чисел: {modify_list(user_list)}')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ESh4StEfY3Xq","executionInfo":{"status":"ok","timestamp":1738002966532,"user_tz":-60,"elapsed":5476,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"2353a294-c960-4a8d-d02c-5d8647d211fd"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите список чисел, разделенных пробелами: 1 2 3 4 5\n","Измененный список чисел: [2, 1, 6, 2, 10]\n"]}]},{"cell_type":"markdown","source":["```\n","Изменения внутри функции: список, который мы передаем в функцию, это ссылка (не\n","сам список). Новый список, который я создал внутри функции - новая переменная и\n","ссылается она на новый объект в памяти.\n","Изменяемые можно изменить на месте, и изменения будут видны вне функции.\n","Неизменяемые нельзя изменить на месте, и любые изменения создают новый объект.\n","В нашем случае мы создаем новый список new_list, изменения не влияют на\n","оригинальный список user_list.\n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает произвольное количество аргументов от\n","пользователя и передает их в функцию calculate_sum, которая возвращает сумму\n","всех аргументов. Используйте оператор * при передаче аргументов в функцию.\n","Выведите результат на экран.\n","\n","Пример вывода:\n","Введите числа, разделенные пробелами: 1 2 3 4 5\n","Сумма чисел: 15\n","```"],"metadata":{"id":"aa7lsZYAFW_W"}},{"cell_type":"code","source":["def calculate_sum(*args):\n","    return sum(args)"],"metadata":{"id":"BvxRN8RD3WjP"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["user_numbers = list(map(int, input('Введите числа, разделенные пробелами: ').split()))\n","result = calculate_sum(*user_numbers)\n","print(f'Сумма чисел: {result}')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"YsAbYeLjDXt-","executionInfo":{"status":"ok","timestamp":1737988084680,"user_tz":-60,"elapsed":3600,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"e93212b5-c8b3-46b2-8ba2-6ab3c559476a"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите числа, разделенные пробелами: 1 2 3 4 5\n","Сумма чисел: 15\n"]}]}]}