{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyPO3Sf+S6BPiLgjcVgxFdSm"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая запрашивает у пользователя строку и\n","преобразует ее, удаляя все гласные буквы из строки. Используйте метод\n","replace() для замены гласных букв на пустую строку. Выведите\n","преобразованную строку на экран с помощью команды print.\n","\n","Пример вывода:\n","Введите строку: Hello, world!\n","Результат: Hll, wrld!\n","```"],"metadata":{"id":"pQ4MPb6tg79b"}},{"cell_type":"code","source":["a = input('Введите строку: ')\n","glasnie = 'aeiouy'\n","for i in glasnie:\n","    a = a.replace(i, '')\n","print(a)"],"metadata":{"id":"nI5-KnCYg524","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1732545455122,"user_tz":-60,"elapsed":5042,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"f53ec5f7-069b-40de-e184-bed85aa6d10d"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: Hello, world!\n","Hll, wrld!\n"]}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая запрашивает у пользователя строку и определяет,\n","содержит ли она только уникальные символы. Если все символы в строке уникальны,\n","выведите соответствующее сообщение на экран. В противном случае выведите\n","сообщение о том, какие символы повторяются. Не используйте множества и подобные\n","структуры данных, которые мы пока не изучали, для проверки уникальности символов.\n","\n","Пример вывода:\n","Введите строку: Python\n","Все символы в строке уникальны.\n","Введите строку: Hello world\n","Символы 'l' и 'o' повторяются.\n","```"],"metadata":{"id":"e9rtVhRbhD9F"}},{"cell_type":"code","source":["a = input('Введите строку: ')\n","a = a.replace(' ', '')\n","unique = []\n","not_unique = []\n","for i in a:\n","    if i in unique:\n","        if i not in not_unique:\n","            not_unique.append(i)\n","    else:\n","        unique.append(i)\n","if len(not_unique) == 0:\n","    print('Все символы в строке уникальные')\n","else:\n","    print('Символы', ' и '.join(not_unique), 'повторяются')"],"metadata":{"id":"xi-uYypzg7S7","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1732548242845,"user_tz":-60,"elapsed":5637,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"5b49fe4d-91ff-4e6a-a465-42c990de1d7c"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: Hello world\n","Символы l и o повторяются\n"]}]},{"cell_type":"markdown","source":["```\n","3. Напишите программу, которая запрашивает у пользователя строку и выравнивает\n","ее по центру с заданной шириной. Если строка не может быть выровнена по центру\n","из-за нечетной ширины, она должна быть выровнена смещением вправо. Используйте\n","методы center() и rjust() для выравнивания строки.\n","\n","Пример вывода:\n","Введите строку: Python\n","Введите ширину: 10\n","Результат:\n","  Python\n","```"],"metadata":{"id":"90WZ-_24jb6A"}},{"cell_type":"code","source":["a = input('Введите строку: ')\n","width = int(input('Введите ширину: '))\n","if width % 2 == 0:\n","    print(a.center(width))\n","else:\n","    print(a.rjust(width))"],"metadata":{"id":"gOLKmvC_jsZi","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1732550408170,"user_tz":-60,"elapsed":8410,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"3cb27d71-3737-4da2-a179-004b6c1ce003"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строку: Python\n","Введите ширину: 41\n","                                   Python\n"]}]}]}