{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMp4ksBKDAK0TQq2YQHP4wE"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["```\n","1. Напишите программу, которая принимает список слов от пользователя и\n","использует генераторное выражение (comprehension) для создания нового списка,\n","содержащего только те слова, которые начинаются с гласной буквы. Затем\n","программа должна использовать функцию map, чтобы преобразовать каждое слово в\n","верхний регистр. В результате программа должна вывести новый список, содержащий\n","только слова, начинающиеся с гласной буквы и записанные в верхнем регистре.\n","```"],"metadata":{"id":"gBYQVCfy_leq"}},{"cell_type":"code","source":["# Alex, Sergey, sasha, Elisey, arkadiy, Kristian\n","words = list(map(str.strip, input('Введите слова: ').lower().split(',')))\n","\n","\n","def words_vowels_upper(words: list[str]) -> list[str]:\n","    vowels = 'aeiouy'\n","    words_vowels = [word for word in words if word[0] in vowels]\n","    words_vowels_upper = list(map(str.upper, words_vowels))\n","    return words_vowels_upper\n","\n","words_vowels_upper(words)"],"metadata":{"id":"LhMVhhn4oItS","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739287493935,"user_tz":-60,"elapsed":2419,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"54509c34-0f0d-4e65-b94c-f4aa4db71705"},"execution_count":null,"outputs":[{"name":"stdout","output_type":"stream","text":["Введите слова: Alex, Sergey, sasha, Elisey, arkadiy, Kristian\n"]},{"output_type":"execute_result","data":{"text/plain":["['ALEX', 'ELISEY', 'ARKADIY']"]},"metadata":{},"execution_count":1}]},{"cell_type":"markdown","source":["```\n","2. Напишите программу, которая принимает список чисел от пользователя и\n","использует функцию reduce из модуля functools, чтобы найти произведение всех\n","чисел в списке. Затем программа должна использовать функцию itertools.\n","accumulate для накопления произведений чисел в новом списке. В результате\n","программа должна вывести список, содержащий накопленные произведения.      \n","```"],"metadata":{"id":"quaAAQMN_7yo"}},{"cell_type":"code","source":["from functools import reduce\n","from itertools import accumulate\n","\n","numbers = [2, 4, 6, 8, 10]\n","\n","product_reduce = reduce(lambda x, y: x * y, numbers)\n","print(product_reduce)\n","\n","product_accumulate = list(accumulate(numbers, lambda x, y: x * y))\n","print(product_accumulate)"],"metadata":{"id":"BvxRN8RD3WjP","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1739204187391,"user_tz":-60,"elapsed":43,"user":{"displayName":"Aliaksandr Yuniov","userId":"02358454958403598332"}},"outputId":"a8c34b0c-2c67-4729-c2d3-46003fceeb79"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["3840\n","[2, 8, 48, 384, 3840]\n"]}]}]}